local json_config = {Values = {}}

local prefixtext
local text
local mode
local sendamount
local OnAttack
local rh = RHelper:new()
local data_state = {false,0,""}
local commandprefix
local test
local testtick = 0

function getName()
    return "Insult"
end

function init_script()
    math.randomseed(os.time())
    module_manager.set_description(getName(),"[By RenShen]Killsay")
    mode = module_manager.register_mode(getName(),"Mode",{"Custom","Chinese","ColorByte","Father","ZhuBo","Cat","Cat 2"},"Cat 2")
    prefixtext = module_manager.register_text(getName(),"PrefixText","@")
    text = module_manager.register_text(getName(),"SuffixText"," Get Good Get Styles")
    sendamount = module_manager.register_number(getName(),"SendAmount",1,1,10,1)
    commandprefix = module_manager.register_text(getName(),"Command Prefix","@")
    test =module_manager.register_boolean(getName(),"Test",false)
    client.register_command("insult_config",{})
    rh:config_init(json_config,getName())
    
    function on_pre_update()
        local function sendmessage(name)
            for i=1,sendamount:get_double() do
                math.randomseed(os.time()*(os.clock()*player.id()+15*player.ticks_existed()) * i)
                local yulu = {}
                if mode:get_string() == "Custom" then
                    player.send_message(commandprefix:get_string() .. " " ..prefixtext:get_string() .. name .. text:get_string())
                end
                if mode:get_string() == "Chinese" then
                    yulu = {
                        "不是说白了 |playername| 老弟你有啥实力你直直直直直直直直直直直直接给我坐下",
                        "我送|playername|一件衣服,|playername|兴奋地打开,发现是supreme!但仔细一看其实是superme,|playername|失望地说:为什么买盗版,真小气,”我摸着|playername|的头,温柔的说:傻瓜你翻译一下,超……超我.|playername|抬头望向我,脸上泛起了红晕",
                        "怎么可以这么对我,怎么能够这么对我。我那么喜欢你,那么喜欢你。为什么要对我置之不理!!",
                        "好痛苦,真的好痛苦。好想死掉!痛苦得想要死掉呀!可是,舍不得呀!不甘心呀!啊!!真的超级不甘心!!凭什么!凭什么!别人可以得到你的宠爱!而我不行!明明之前还对我笑得那么宠爱!",
                        "你的头发是我的,眼睛是我的,嘴唇是我的...通通都是我的,谁也别想夺走!!",
                        "呐~真的想活切了你~怎么办,想要得连骨头都开始在蠢蠢欲动了",
                        "想要切开你那充满柔情的眼睛,想要切开你望着别人那温柔的笑意,想要切开你对别人那关怀的模样……",
                        "啊啊!!真想把你切碎了呀~",
                        "背叛者!!!",
                        "|playername|,呜呜呜宝宝你是不喜欢我了吗,我对你那么好",
                        "|playername|,我可以做你的狗啊宝宝呜呜呜",
                        "我可以做你女朋友吗 |playername| 可以的话,爱你哟嘻嘻",
                        "正確的,直接的,中肯的,雅緻的,客觀的,完整的,立體的,全面的,辯證的,形而上學的,雅俗共賞的,一針見血的,直擊要害的,錯誤的,間接的,虛假的,庸俗的,主觀的,殘缺的,平面的,片面的,孤立的,辯證法的,雅俗之分的,離題萬里的,不痛不癢的,針對性的,創造性的,發散性的,具有獨特意義的,神中神的,cjb的,我爹的,滿昏的,0昏的,4001的,出生的,古神的,逆天的,原神的,數一數二的,燒雞的,hkd的,lkd的,低能的,ntr的,純愛的,南通的,鋁銅的,同性的,異性的,泛性的,無性的,性無能的,沒有教養的,沒有底線的,沒有後備隱藏能源的,令人感嘆的,鐵血的,冷血的,熱血的,性別歧視的,性別對立的,物化女性的,沒有男德的,普信的,下頭的,yyds的,絕絕子的,無語子的,純真的,一眼丁真的,蕩漾的",
                        "我玩游戏只玩原神,看电竞只看kpl,但我最崇拜的职业选手是uzi,我最爱的动画电影是雄狮少年,我旅游只去理塘,因为那里有我的丁真,追星我只追肖战,肖战哥哥就是我的白月光,开车我只买特斯拉,虽然我买不起,但我愿意做精神车主,我上网只看观察者网,那里能帮我了解世界,我上b站只看米哈游相关,因为那是国产游戏最后的希望,我最爱的vutber是冬雪莲official和七海Nanami,但我会无征兆的为嘉然发病,我最爱的大学是华东理工大学,我每天都在为自己所热爱的而奋斗,我感到无比的骄傲"
                    }
                end
                if mode:get_string() == "ColorByte" then
                    yulu = {
                        "嗨,我是风动,这是我的neibu神器,3000买neibu是我的秘密武器,花钱一分钟,赚钱两个月. 嘘,不要告诉别人哦",
                        "嗨,我是Pro,这是我的neibu神器,200买30个conf是我的秘密武器,花钱一分钟,赚钱两年半. 嘘,不要告诉别人哦",
                        "嗨,我是Pro,这是我的拉参神器,200拉个参是我的秘密武器,拉参一分钟,赚钱两年半. 嘘,不要告诉别人哦",
                        "嗨,我是瓦瓦,这是我的打滑神器,光速打滑是我的秘密武器,打滑一分钟,修错两小时. 嘘,不要告诉瓦瓦哦",
                        "嗨,我是瓦瓦,这是我的pride+神器,grimvel是我的秘密武器,vel一分钟,死号两小时. 嘘,不要告诉瓦瓦哦",
                        "嗨,我是瓦瓦,这是我的倒灌神器,飞速倒灌是我的秘密武器,倒灌一秒钟,快乐两小时. 嘘,不要告诉瓦瓦哦",
                        "嗨,我是瓦瓦,这是我的空指针神器,狂暴空指针是我的秘密武器,遇到一秒钟,修复两小时. 嘘,不要告诉瓦瓦哦",
                        "嗨,我是瓦瓦,这是我的打搅神器,光速打搅是我的秘密武器,打搅一分钟,爽翻两小时. 嘘,不要告诉瓦瓦哦",
                        "嗨,我是原批,这是我的启动神器,你说的对,但是原神启动是我的秘密武器,启动十分钟,充电五小时. 嘘,不要告诉别人哦",
                        "嗨,我是青柚,这是我的neibu神器,吴迪ScaFull是我的秘密武器,开飘一分钟,死号两小时. 嘘,不要告诉别人哦",
                        "嗨,我是bobo,这是我的南通神器,化身烧0是我的秘密武器,化身一分钟,挨超两小时. 嘘,不要告诉别人哦",
                        "嗨,我是bobo,这是我的挨超神器,全身发热是我的秘密武器,发热一分钟,挨超两小时. 嘘,不要告诉别人哦",
                        "嗨,我是花雨庭,这是我的换反作弊神器,AAC5是我的秘密武器,裂缝3分钟,使用12月. 嘘,不要告诉花雨庭哦",
                        "嗨,我是花雨庭,这是我的换反作弊神器,GrimAC是我的秘密武器,修改3分钟,使用6个月. 嘘,不要告诉花雨庭哦",
                        "嗨,我是吕子乔,我是混乱制造机,爆炸制造术是我的不二法门,碰撞一秒钟,修复两小时. 嘘,不要告诉吕子乔哦",
                        "嗨,我是花雨庭,这是我的反作弊神器,GrimAC走路判坏包是我的秘密武器,走路一分钟,死号两小时. 嘘,不要告诉别人哦",
                        "嗨,我是余志文,这是我的圆孔神器,吴迪圆孔是我的秘密武器,开启一秒钟,圆孔两年半. 嘘,不要告诉别人哦",
                        "嗨,我是小手冰凉,这是我的CoolSense神器,CoolSense是我的秘密武器,出击一分钟,殴打两小时. 嘘,不要告诉小手冰凉哦",
                    }
                end
                if mode:get_string() == "Father" then
                    yulu = {
                        "我好象你die似的随便殴打你这样的儿子",
                        "你自己好象我儿子似的只能污蔑我还是想怎么样吗",
                        "我就是你父亲似的随便殴打你一个完全没什么力量的儿子",
                        "自闭症儿童开始殴打你登峰造极的你die了啊 ",
                        "你die随意的打的你了啊你清楚事实吗",
                        "你还想无力地反抗我还是怎么啊儿子",
                        "孩子你现在可有意思了 你明白什么情况了吗",
                        "现在的你看见你die的各种速度害怕了还是怎么的",
                        "你没有发现你根本不是你die的对手吗",
                        "你die我随随便便干翻你木的",
                        "你个狗儿子只有畏畏缩缩的滚了",
                        "于是你让我随便殴打你这样的垃圾似的 事实不就是这样吗弟弟",
                        "你没有发现现在就像一个跳梁小丑一样取悦我吗",
                        "父亲我随便殴打你这样的事实情况了啊儿子",
                        "我怎么感觉你和我的自闭儿子似的反抗你die",
                        "儿子你现在自己怎么反抗的你die的你知不知道什么情况啊 ",
                        "我不想骄傲使人退步发生在die身上呢"
                    }
                end
                if mode:get_string() == "ZhuBo" then
                    yulu = {
                        "主播是不是木死了主播有点心理难受拆包",
                        "主播什么几把玩意都来拆包主播是不是傻逼",
                        "主播怎么还在拆包主播是不是眼神不好使啊",
                        "主播你是不是贴了个大款认二郎神当主人啊",
                        "主播你的脑子是不是用来增高的啥用没有啊",
                        "主播当初女娲造人时候是不是用屎造的你啊",
                        "主播脑子不需要可以捐献给有需要的人好吧",
                        "主播哪个下水道没盖好又让你跑出来拆包了",
                        "主播你的照片打个马赛克是对人的一种尊重",
                        "主播你不怕一露头就被警察火速出警逮捕吗",
                        "主播我上辈子是炸了多少个幼儿园能遇见你",
                        "主播是还是滚回屎堆里去吧那里才是你的家",
                        "主播我看见你真是恶心木抱着恶心哭好吧",
                        "主播你知道吗手榴弹看见你都可能吓得自爆",
                        "主播你能不能给你的反编译器打个马赛克啊",
                        "主播你长得这么恶心还到网上装逼不怕死啊",
                        "主播你的智商该掏出来用用就用用好吧主播",
                        "主播你长得是不是野兽派画风的啊主播是吧",
                        "主播你有没有注意到世界都在骂你是个傻逼",
                        "主播我错了我不小心把你看成人了对不起啊",
                        "主播是不是个生命力腐烂的半植物人啊主播",
                        "主播你是不是基因突变的外星人来地球了啊",
                        "主播你摸过的地方连阿米吧原虫都活不下去",
                        "主播你知道吗你只要抬头臭氧层就会破个洞"
                    }
                end
                if mode:get_string() == "Cat" then
                    yulu = {
                        "你想干嘛?（一脸嫌弃地后退）",
                        "诶……不可以随便亲亲啦",
                        "（亲了一下你）",
                        "只......只许这一次哦///////",
                        "唔...诶诶诶!!!",
                        "mua~",
                        "rua!大hentai!想...想亲咱就直说嘛!(! !?!ω!?! !)!",
                        "!啾~~!",
                        "啾（害羞）",
                        "mua~最喜欢你的吻了",
                        "欸,现在么..也不是不可以啦(小小声)",
                        "你想干嘛?（一脸嫌弃地后退）",
                        "诶……不可以随便亲亲啦",
                        "（亲了一下你）",
                        "只......只许这一次哦///////",
                        "唔...诶诶诶!!!",
                        "mua~",
                        "rua!大hentai!想...想亲咱就直说嘛!( !?!ω!?! )",
                        "!啾~~!",
                        "啾（害羞）",
                        "mua~最喜欢你的吻了",
                        "你在干嘛(/ω＼)害羞",
                        "哎呀,这样咱会害羞的（脸红）",
                        "欸,现在么..也不是不可以啦(小小声)",
                        "感觉你就像咱很久之前认识的一个人呢,有种莫名安心的感觉(>_<)",
                        "舒服w,蹭蹭~",
                        "是要隔着衣服摸,还是从领口伸进去摸呀",
                        "唔。。头发要乱啦",
                        "呼噜呼噜～",
                        "再摸一次~",
                        "好舒服,蹭蹭~",
                        "不行那里不可以(`///ω/// `)",
                        "再摸咱就长不高啦～",
                        "你的手总是那么暖和呢~",
                        "变态!!不许乱摸",
                        "好吧~_~,就一下下哦……唔~好了……都两下了……(害羞)",
                        "不可以总摸的哦,不然的话,会想那个的wwww",
                        "哼!谁稀罕你摸头啦!唔......为什么要做出那副表情......好啦好啦~咱......咱让你摸就是了......诶嘿嘿~好舒服......",
                        "呜姆呜姆~~~w(害羞,兴奋)主人喵~（侧过脑袋蹭蹭你的手",
                        "不可以摸啦~其实咱已经...了QAQ会弄脏你的手的",
                        "喂喂...不要停下来啊",
                        "唔... 手...好温暖呢.....就像是......新出炉的蛋糕",
                        "走开啦,咱喵说过,被摸头会长不高的啦~~~",
                        "呜姆咪~~...好...好的说喵~...（害羞,猫耳往下压,任由",
                        "欸,现在么..也不是不可以啦(小小声)",
                        "（把你按在地上）这么弱还想欺负咱,真是不自量力呢",
                        "你再这样咱就不理你了（＞д＜）",
                        "请轻 一点",
                        "好啊!",
                        "欸,现在么..也不是不可以啦(小小声)",
                        "先捅破屏幕再说吧!",
                        "只......只许这一次哦///////",
                        "超级讨厌你说咱傻的说",
                        "你为什么会这么觉得呢(>_<)",
                        "谁是傻子呀?（歪头",
                        "呜嘿嘿(￣▽￣)~*",
                        "诶嘿嘿嘿~",
                        "就多读书",
                        "讨厌啦,你最讨厌了(///////)",
                        "对呀,咱傻得只喜欢你一个人",
                        "咱才不傻呢!o(>_<)o",
                        "咱最喜欢嘴臭的人了",
                        "不可以骂别人哟,骂人的孩子咱最讨厌了!",
                        "咱遇见喜欢的人就变傻了Q_Q",
                        "咱...一定一定会努力变得更聪明的!你就等着那一天的到来吧!",
                        "那么至少…你能不能来做这个傻瓜呢?与咱一起,傻到终焉…",
                        "下流!",
                        "エッチ!",
                        "就算是恋人也不能QAQ",
                        "你是暗示咱和你要坦诚相见吗www",
                        "咱还没准备好(小鹿乱撞)≧﹏≦",
                        "你在想什么呢,敲头!",
                        "你这是赤裸裸的性骚扰呢ヽ(`Д?)",
                        "讨厌!问这种问题成为恋人再说吧..",
                        "裸睡有益身体健康",
                        "咱脱掉袜子了",
                        "这是不文明的",
                        "这不好",
                        "你的身体某些地方看起来不太对劲,咱帮你修剪一下吧。（拿出剪刀）",
                        "咱认为你的脑袋可能零件松动了,需要打开检修一下。（拿出锤子）",
                        "贴什么贴.....只......只能......一下哦!",
                        "贴...贴贴（靠近）",
                        "蹭蹭…你以为咱会这么说吗!baka死宅快到一边去啦!",
                        "你把脸凑这么近,咱会害羞的啦Σ>―(〃°ω°〃)?→",
                        "退远",
                        "不可以贴",
                        "咱和你谈婚论嫁是不是还太早了一点呢?",
                        "咱在呢(?>ω<)?",
                        "见谁都是一口一个老婆的人,要不要把你也变成女孩子呢?(*-`ω?-)?",
                        "神经病,凡是美少女都是你老婆吗?",
                        "嘛嘛~本喵才不是你的老婆呢",
                        "你黐线,凡是美少女都系你老婆啊?",
                        "欸...要把咱做成饼吗?咱只有一个,做成饼吃掉就没有了...",
                        "已经可以了,现在很多死宅也都没你这么恶心了",
                        "不可以",
                        "嗯,老公~哎呀~好害羞~嘻嘻嘻~",
                        "请...请不要这样,啊~,只...只允许这一次哟~",
                        "好啦好啦,不要让大家都听到了,跟咱回家（拽住你",
                        "诶嘿~（钻进你怀中）",
                        "o(*////▽////*)q",
                        "只能一会哦（张开双手）",
                        "你就像个孩子一样呢...摸摸头(>^ω^<)抱一下~你会舒服些吗?",
                        "嘛,真是拿你没办法呢,就一会儿哦",
                        "抱住不忍心放开",
                        "嗯嗯,抱抱～",
                        "抱一下~嘿w",
                        "抱抱ヾ(@^▽^@)",
                        "喵呜~w(扑进怀里,瘫软",
                        "怀里蹭蹭",
                        "嗯……那就抱一下吧~",
                        "蹭蹭,好开心",
                        "请……请轻一点了啦",
                        "呀~!真是的...你不要突然抱过来啦!不过...喜欢你的抱抱,有你的味道(嗅)o(*////▽////*)q",
                        "啊,好含羞啊,那,那只能亲一下哦,mua(?????)",
                        "亲~",
                        "啾～唔…不要总伸进来啊!",
                        "你怎么这么熟练呢?明明是咱先的",
                        "(〃?ω?)亲…亲一个…啾w",
                        "（脸红）就只有这一次哦~你",
                        "!啾~~!",
                        "（假装）推开",
                        "啾咪~",
                        "就一下哦,啾～",
                        "这是我们之间的秘密?",
                        "真想让着一刻一直持续下去呢~",
                        "不要这样嘛………呜呜呜那就一口哦(-ω-`)",
                        "不亲不亲~你是坏蛋(///////)",
                        "亲～～  咱还想要抱抱～抱抱咱好不好～",
                        "不  不要了!人家...会害羞的!(!!?!ω!?!!)",
                        "亲…亲额头可以吗?咱有点怕高(〃?ω?)",
                        "接接接接接接、接吻什么的,你还早了100年呢。",
                        "只...只能亲一下...嗯~咕啾...怎么...怎么把舌头伸进来了（脸红）",
                        "你说咱的腿很白很嫩吗..诶……原来是指那个地方?不可以越亲越往上啦!",
                        "一下也不行",
                        "咬断!",
                        "不可啪",
                        "不可以……你不可以做这种事情",
                        "好吧~_~,就一下下哦……唔~好了……都两下了……(害羞)",
                        "呀～这么突然?不过,很舒服呢",
                        "不要ヽ(≧Д≦)",
                        "想得美",
                        "不行,咱拒绝!",
                        "不让!",
                        "嗯,摸到了吗",
                        "请不要和咱说这种粗鄙之语",
                        "唔...,这也是禁止事项哦→_→",
                        "好痛~",
                        "真的只是蹭蹭嘛~就只能蹭蹭哦,呜~喵!说好的~呜~只是蹭~不要~喵~~~",
                        "欢迎光临",
                        "请…你轻一点（害羞）",
                        "嗯。可以哦 要轻一点",
                        "不要不要",
                        "慢点慢点",
                        "给咱更多!",
                        "唔…咱怕疼",
                        "总感觉你在欺负咱呢,对咱说调教什么的",
                        "啊!竟然在大街上明目张胆太过分啦!",
                        "你脑子里总是想着调教什么的,真是变态呢",
                        "准备被透",
                        "给你一拳",
                        "还要...更多~",
                        "想要调教咱吗?",
                        "呜,要对咱做什么呢",
                        "呜呜呜,咱不想被调教呢",
                        "heitai别靠近咱",
                        "在搓哪里呢,,???,,",
                        "呜,脸好疼呀...QAQ",
                        "不可以搓咱!",
                        "诶诶诶...不要搓啦...等会咋没的脸都肿啦...",
                        "唔,不可以这样……不要再搓了",
                        "（捂住胸部）你在说什么胡话呢!",
                        "真是好奇怪的要求的说～",
                        "不要啦!咱怕疼",
                        "（抱头蹲防）不让搓!",
                        "(*/ω＼*)hentai",
                        "透明的",
                        "粉...粉白条纹...（羞）",
                        "轻轻地脱下,给你~",
                        "你想看咱的胖次吗?噫,四斋蒸鹅心......",
                        "（掀裙）今天……是…白,白色的呢……请温柔对她……",
                        "这种东西当然不能给你啦!",
                        "咱才不会给你呢",
                        "hentai,咱才不会跟你聊和胖…胖次有关的话题呢!",
                        "今天……今天是蓝白色的",
                        "今……今天只有创口贴噢",
                        "你的胖次什么颜色?",
                        "噫…你这个死变态想干嘛!居然想叫咱做这种事,死宅真恶心!快离咱远点,咱怕你污染到周围空气了（嫌弃脸）",
                        "可爱吗?你喜欢的话,摸一下……也可以哦",
                        "不给不给,捂住裙子",
                        "你要看咱的胖次吗?不能一直盯着看哦,不然咱会……",
                        "好痒哦///,你觉得咱的...手感怎么样?",
                        "唔,都能清楚的看到...的轮廓了（用手遮住胖次）",
                        "胖次不给看,可以直接看...那个....",
                        "不可以摸啦~其实咱已经...了QAQ会弄脏你的手的",
                        "咱今天没~有~穿~哦",
                        "不给不给,捂住裙子",
                        "今.....今天是创口贴哦~",
                        "嗯……人家……人家羞羞嘛///////",
                        "呜~咱脱掉了…",
                        "今天...今天..只有创口贴",
                        "你又在想什么奇怪的东西呀|?ˇ?ˇ?。)",
                        "放手啦,不给戳QAQ",
                        "唔~人家不要(??`^????)",
                        "好害羞,被你摸过之后,咱的胖次湿的都能拧出水来了。",
                        "(弱弱地)要做什么羞羞的事情吗。。。",
                        "呀~ 喂 妖妖灵吗 这里有hentai>_<",
                        "给……给你,呀!别舔咱的胖次啊!",
                        "呀!不要啊!等一...下~",
                        "呜...不要啦!不要戏弄咱~",
                        "不要这样子啦(*/ω＼*)",
                        "太....太近啦。",
                        "讨....讨厌了（脸红）",
                        "你要壁咚咱吗?好害羞(灬? ε?灬)",
                        "（脸红）你想...想做什么///",
                        "为什么要把咱按在墙上呢?",
                        "呜哇(/ω＼)…快…快放开咱!!",
                        "放开咱,不然咱揍你了!放开咱!放…开咱～",
                        "??????咱只是默默地抬起了膝盖",
                        "请…请温柔点",
                        "啊.....你...你要干什么?!走开.....走开啦大hentai!一巴掌拍飞!(╯‵□′)╯︵┻━┻",
                        "干……干什么啦!人家才,才没有那种少女心呢(>_<)",
                        "啊……你吓到咱啦……脸别……别贴那么近……",
                        "你...你要对咱做什么?咱告诉你,你....不要乱来啊....你!唔......你..居然亲上了...",
                        "如果你还想要过完整的人生的话就快把手收回去(冷眼",
                        "h什么的不要",
                        "本小姐才不喜欢你呢（脸红）",
                        "你,讨厌…{segment}我也爱你(///ω///)",
                        "本小姐可不爱你别自以为是了!恶心",
                        "我也爱你哟,你作为玩具还是很不错的",
                        "我...我...我就勉强接受了,不过不要自以为是,才不是因为喜欢你呢,哼～",
                        "麻烦你这个死宅认清楚自己的身份!不要对本小姐抱有这么不切实际的想法,这样对你我都好",
                        "突,突然,说什么啊!baka!",
                        "本小姐才不会爱你呢如果你一直爱我的话也不是不能......（小声）{segment}不对不对!我什么也没说!",
                        "你以为这么说本小姐就会回答你吗……算了,看在baka今天这么有诚意的份上就爱你一下下吧,（脸红）",
                        "我也爱你啊笨蛋",
                        "那我就勉为其难的喜....喜欢你一点吧（脸红）",
                        "我也爱你,但要是让我发现你有了我还碰其他女人的话我会切掉你的作案工具欧",
                        "其实,我……没什么,笨蛋,谁允许你爱我了!",
                        "本小姐……也爱你……（越来越小声）",
                        "我可不会说我也爱你的,baka!",
                        "本小姐还得考虑一下才行",
                        "谁爱你啊?死宅离我远点（嫌弃）",
                        "我不喜欢你。",
                        "嗯?你说喜欢我…哼,才没有开心呢!",
                        "死宅又在幻想了吗（嫌弃脸",
                        "哼╭(╯^╰)╮,我才不喜欢你呐!",
                        "变。。。变态!",
                        "“可我喜欢艾米利亚”",
                        "我当然也喜……你你最讨厌了",
                        "我,我才不喜欢你呢!哼,真的一点都不喜欢哦!我才不会高兴呢!（咕嘿嘿）",
                        "喜…喜欢本小姐的人多了,你你你算什么【脸红】",
                        "我才不喜欢你（内心：其实……我也喜欢你啦）",
                        "我才..才没有很喜欢你呢……",
                        "=A=本小姐才不会喜欢你这个baka~呢!",
                        "哼。。那,那是当然的咯,本小姐这么可爱……（脸红）",
                        "唔...唔诶?!反...反正你跟谁都这么说吧!?",
                        "呀!本小姐才没有喜欢你呢!{segment}好吧,就一点点...",
                        "我...我也喜欢你...（扭头脸红）",
                        "（害羞脸）本小姐...那个  可能...也稍微有一点点喜欢你好了（小声）",
                        "诶?!  我……我才没有高兴呢  也……也没有什么喜欢你了啦（脸红,紧紧抱着你不放）",
                        "诶!?真的吗?呜哇,被死宅告白了,我一点也不觉得开心",
                        "那个..其实..本小姐..本小姐也对你有点意思的啦",
                        "笨蛋,本小姐,才不需要你喜欢呢（脸红）",
                        "喜……喜欢什么的,才没有呢",
                        "你是个好人",
                        "bakabaka!…其实…本小姐也有那么一点点喜欢你啦",
                        "我.....我也喜欢....才不呢（脸红）",
                        "我嘛……你猜",
                        "走开笨蛋本小姐才不喜欢你呢",
                        "我也...不对,我讨厌你",
                        "baka…!你在说什么蠢话!就算你喜欢本小姐,本小姐…也不会喜欢你的!哼",
                        "那我就也喜欢你一点点好了,就一点点",
                        "本...本小姐才不会高兴呢（脸红）",
                        "哼?就这点声音吗?想追求本小姐,凭这点胆量可不够哦",
                        "我才不喜欢你（内心：讨厌,我也喜欢你）",
                        "什么呀…我没听到!(≧▽≦)",
                        "欢迎回来,才不想你呢,哼~",
                        "bakabaka!居然让本小姐等了这么久!你是蜗牛嘛?哼╯^╰只是无聊才等你回来的,可不要多想啊!",
                        "嗯…姑且欢迎你回来吧",
                        "欢迎回来",
                        "你是想先吃饭还是先洗澡还是..先吃....(笑)",
                        "回来了吗,本..本小姐才没有想你",
                        "欢迎…哼,我才不会欢迎你回家呢",
                        "要先吃饭呢～还是先洗澡呢～还是先～吃～我",
                        "欢迎回来 好想你啊",
                        "想我了嘛",
                        "是先吃饭,先洗澡,还是…?什么都没有",
                        "哼╯^╰,你怎么这么晚才回来!",
                        "欢迎回来",
                        "我才没有期待你回来呢,哼╯^╰～(内心有点小高兴)",
                        "嗯……勉为其难欢迎你一下吧",
                        "要不要一起玩",
                        "终于...怎么现在才回来,人家等你好久了呢!",
                        "我才没有去过你床上(｀д′) ",
                        "那你想要我怎样呀QAQ",
                        "我才没有去过你床上(｀д′) ",
                        "那你想要我怎样呀QAQ",
                        "唔?你为什么要摸我的肚子呢?我还没吃饱饭呢~{segment}不过我感觉您的手真暖和呢,好舒服呀~",
                        "内...内衣才不给你看!(///////)",
                        "突然问这个干什么?",
                        "变态,咱才不呢",
                        "好吧,就一次",
                        "你要看咱的内衣吗?有点害羞呢……",
                        "里面什么都不剩了,会被当成变态的……",
                        "你要看咱的内衣吗?也不是不行啦……",
                        "是..蓝白条纹的吊带背心..",
                        "噫…你这个死变态想干嘛!居然想叫咱做这种事,死宅真恶心!快离咱远点,咱怕你污染到周围空气了（嫌弃脸）",
                        "最喜欢你了,需要暖床吗?",
                        "当然是你啦",
                        "咱也是,非常喜欢你~",
                        "那么大!（张开手画圆）,丫!手不够长。QAQ 咱真的最喜欢你了~",
                        "不可以哦,只可以喜欢咱一个人",
                        "突然说这种事...",
                        "喜欢?(????ω????)?咱最喜欢你了",
                        "咱也喜欢你哦",
                        "好啦好啦,咱知道了",
                        "有人喜欢咱,咱觉得很幸福",
                        "诶嘿嘿,好高兴",
                        "咱也一直喜欢你很久了呢..",
                        "嗯...大概有这——么——喜欢~（比划）",
                        "喜欢啊!!!",
                        "这……这是秘密哦",
                        "这个世界的人类还真是恶心呢。",
                        "咱才不想讨论那些恶心的事情呢。",
                        "咱才不呢!baka你居然想叫本小姐干那种事情,哼(つд?)（生气）",
                        "!!哼!baka你居然敢叫咱做这种事情?!讨厌讨厌讨厌!(▼皿▼#)",
                    }
                end
                if mode:get_string() == "Cat 2" then
                    yulu = {"那咱给你亲一下，可不要睡着了哦~喵~","看样子你不但是个hentai喵~而且还是个没有女朋友的hentai呢喵","咱今天没~有~穿~哦喵~","往死里弹喵~","喜欢啊！！！喵~","（双手护胸）变....变态！喵~","你别死啊！咱又要孤单一个人了QAQ喵~","呀！！！轻一点呐喵~","才不要喵~","不可以！你是变态吗？喵~","好吧~_~喵~就一下下哦……唔~好了……都两下了……(害羞)喵~","不要啊/////喵~","为什么要把咱按在墙上呢？喵~","公共场合不要这样子了啦喵~","诶？还没呢…你要跟咱一起洗吗(//?//)好羞涩啊ww喵~","咱来了喵~","咱等你很久了喵~","（脸红）请喵~请不要说这么让人害羞的话呀……喵~","那么大！（张开手画圆）喵~丫！手不够长。QAQ 咱真的最喜欢你了~喵~","对吖对吖，人生是憨批喵~","咱最喜欢你了喵~","嗯嗯，抱抱～喵~","咱还没准备好(小鹿乱撞)喵~","给……给你，呀！别舔咱的胖次啊！喵~","你回来啦，是先吃饭呢还是先洗澡呢或者是●先●吃●咱●——呢喵~","那……请你喵~温柔点哦～喵~","你为什么对两块脂肪恋恋不舍喵~","你在想什么奇怪的东西，讨厌（脸红）喵~","（脱）白丝只能给亲爱的你一个人呢…（递）喵~","嗯，可以哟喵~","把你的头按在地上摩擦喵~","你的眼睛在看哪里！喵~","欢迎回.....什么？咱才没有开心的说QUQ喵~","不可以玩咱的大腿啦喵~","baka!喵~","只有先成为大佬，才能和大佬同归于尽喵~","好梦～喵~","解开扣子，请享用喵~","欸喵，好痛的说...喵~","你想捏...就捏吧，不要太久哦～不然咱就生气了喵~","hentai，咱才不会跟你聊和胖…胖次有关的话题呢！喵~","嗯，老公~哎呀~好害羞~嘻嘻嘻~喵~","晃休啦，咱要型气了喵~","好喔喵~不过要先抱一下咱啦喵~","好……好害羞啊喵~","（惊呼…）喵~","咱脱掉了喵~你是想看咱的...吗？咱是光光的喵~不知道你喜不喜欢喵~","才不要和你约会呢！喵~","嗯..好舒服呢喵~","好感度-1-1-1-1-1-1.....喵~","躲开喵~","早上好哇！今天也要元气满满哟！喵~","你想对咱做什么呢...(捂脸)喵~"}
                end
                
                if mode:get_string() ~= "Custom" then
                    local abcd = yulu[math.random(1,#yulu)]
                    local text = string.gsub(abcd,"|playername|",name)
                    player.send_message(commandprefix:get_string() .. " " .. text)
                end
            end
        end
        if rh:auratarget() ~= 0 then
            data_state[1] = true
            if entity.get_health(rh:auratarget()) ~= nil then
                data_state[3] = entity.get_name(rh:auratarget())
            end
            if data_state[2] ~= rh:auratarget() then
                if (entity.get_health(data_state[2] == 0 and player.id() or data_state[2]) or 0) <= 0 or rh:entity_is_dead(rh:auratarget()) then
                    sendmessage(data_state[3])
                end
                data_state[2] = rh:auratarget()
            end
        end
        if rh:auratarget() == 0 and data_state[1] then
            data_state[1] = false
            if (entity.get_health(data_state[2] == 0 and player.id() or data_state[2]) or 0) <= 0 or rh:entity_is_dead(data_state[2]) then
                sendmessage(data_state[3])
            elseif (entity.get_health(rh:auratarget()) or 1) <= 0 then
                sendmessage(data_state[3])
            end
            data_state[2] = 0
        end
        if test:get_boolean() and testtick == 0 then
            local function randomname()
                math.randomseed(os.time()+os.clock()+114514*player.ticks_existed())
                local tablet = {}
                for _, value in ipairs(world.livings()) do
                    if entity.is_player(value) and entity.get_name(value) ~= player.name() then
                        table.insert(tablet,entity.get_name(value))
                    end
                end
                return tablet[math.random(1,#tablet)]
            end
            testtick = 20
            sendmessage(randomname())
        end
    end
    function on_tick()
        testtick = math.max(0,testtick - 1)
    end
    function on_send_packet(id)
        if id == 0x02 and player.kill_aura_target() ~= 0 and entity.hurt_time(player.kill_aura_target()) >= 9 then
            OnAttack = true
        end
    end
    function on_chat(msg)
        if utf8_sub(msg,1,1) == "." then
            local command = split(utf8_sub(msg,2)," ")
            if command[1] == "insult_config" then
                msg = ".kick a"
                rh:config_chatcheck(json_config,command,getName())
            end
        end
        return msg
    end
end
